mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dfxg/s6e2dfxg.svd
        <!-- REGISTER "EPFR11" -->
        <register>
          <name>EPFR11</name>
          <description>Extended Pin Function Setting Register 11 [BHW]</description>
          <addressOffset>0x62C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x03FFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UERLC" -->
            <field>
              <name>UERLC</name>
              <description>UERLC relocation select bit</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED15B" -->
            <field>
              <name>UED15B</name>
              <description>UED15B Input/Output Select bit</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED14B" -->
            <field>
              <name>UED14B</name>
              <description>UED14B Input/Output Select bit</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED13B" -->
            <field>
              <name>UED13B</name>
              <description>UED13B Input/Output Select bit</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED12B" -->
            <field>
              <name>UED12B</name>
              <description>UED12B Input/Output Select bit</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED11B" -->
            <field>
              <name>UED11B</name>
              <description>UED11B Input/Output Select bit</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED10B" -->
            <field>
              <name>UED10B</name>
              <description>UED10B Input/Output Select bit</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED09B" -->
            <field>
              <name>UED09B</name>
              <description>UED09B Input/Output Select bit</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED08B" -->
            <field>
              <name>UED08B</name>
              <description>UED08B Input/Output Select bit</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED07B" -->
            <field>
              <name>UED07B</name>
              <description>UED07B Input/Output Select bit</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED06B" -->
            <field>
              <name>UED06B</name>
              <description>UED06B Input/Output Select bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED05B" -->
            <field>
              <name>UED05B</name>
              <description>UED05B Input/Output Select bit</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED04B" -->
            <field>
              <name>UED04B</name>
              <description>UED04B Input/Output Select bit</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED03B" -->
            <field>
              <name>UED03B</name>
              <description>UED03B Input/Output Select bit</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED02B" -->
            <field>
              <name>UED02B</name>
              <description>UED02B Input/Output Select bit</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED01B" -->
            <field>
              <name>UED01B</name>
              <description>UED01B Input/Output Select bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED00B" -->
            <field>
              <name>UED00B</name>
              <description>UED00B Input/Output Select bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA07E" -->
            <field>
              <name>UEA07E</name>
              <description>UEA07E Output Select bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA06E" -->
            <field>
              <name>UEA06E</name>
              <description>UEA06E Output Select bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA05E" -->
            <field>
              <name>UEA05E</name>
              <description>UEA05E Output Select bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA04E" -->
            <field>
              <name>UEA04E</name>
              <description>UEA04E Output Select bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA03E" -->
            <field>
              <name>UEA03E</name>
              <description>UEA03E Output Select bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA02E" -->
            <field>
              <name>UEA02E</name>
              <description>UEA02E Output Select bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA01E" -->
            <field>
              <name>UEA01E</name>
              <description>UEA01E Output Select bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECS0E" -->
            <field>
              <name>UECS0E</name>
              <description>UECS0E Output Select bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEALEE" -->
            <field>
              <name>UEALEE</name>
              <description>UEALEE Output Select bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR12" -->
        <register>
          <name>EPFR12</name>
          <description>Extended Pin Function Setting Register 12 [BHW]</description>
          <addressOffset>0x630</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F3C3F3C</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIOB11S" -->
            <field>
              <name>TIOB11S</name>
              <description>TIOB11 Input Select bits</description>
              <msb>29</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA11E" -->
            <field>
              <name>TIOA11E</name>
              <description>TIOA11 Output Select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA11S" -->
            <field>
              <name>TIOA11S</name>
              <description>TIOA11 Input Select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB10S" -->
            <field>
              <name>TIOB10S</name>
              <description>TIOB10 Input Select bits</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA10E" -->
            <field>
              <name>TIOA10E</name>
              <description>TIOA10 Output Select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB9S" -->
            <field>
              <name>TIOB9S</name>
              <description>TIOB9 Input Select bits</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA9E" -->
            <field>
              <name>TIOA9E</name>
              <description>TIOA9 Output Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA9S" -->
            <field>
              <name>TIOA9S</name>
              <description>TIOA9 Input Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB8S" -->
            <field>
              <name>TIOB8S</name>
              <description>TIOB8 Input Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA8E" -->
            <field>
              <name>TIOA8E</name>
              <description>TIOA8 Output Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR13" -->
        <register>
          <name>EPFR13</name>
          <description>Extended Pin Function Setting Register 13 [BHW]</description>
          <addressOffset>0x634</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F3C3F3C</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIOB15S" -->
            <field>
              <name>TIOB15S</name>
              <description>TIOB15 Input Select bits</description>
              <msb>29</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA15E" -->
            <field>
              <name>TIOA15E</name>
              <description>TIOA15 Output Select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA15S" -->
            <field>
              <name>TIOA15S</name>
              <description>TIOA15 Input Select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB14S" -->
            <field>
              <name>TIOB14S</name>
              <description>TIOB14 Input Select bits</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA14E" -->
            <field>
              <name>TIOA14E</name>
              <description>TIOA14 Output Select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB13S" -->
            <field>
              <name>TIOB13S</name>
              <description>TIOB13 Input Select bits</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA13E" -->
            <field>
              <name>TIOA13E</name>
              <description>TIOA13 Output Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA13S" -->
            <field>
              <name>TIOA13S</name>
              <description>TIOA13 Input Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB12S" -->
            <field>
              <name>TIOB12S</name>
              <description>TIOB12 Input Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA12E" -->
            <field>
              <name>TIOA12E</name>
              <description>TIOA12 Output Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR14" -->
        <register>
          <name>EPFR14</name>
          <description>Extended Pin Function Setting Register 14 [BHW]</description>
          <addressOffset>0x638</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3FFC003F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "E_SPLC" -->
            <field>
              <name>E_SPLC</name>
              <description>Input cutoff Select bit in Standby of input Pin for Ethernet-MAC</description>
              <msb>29</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "E_PSE" -->
            <field>
              <name>E_PSE</name>
              <description>PPS0_PPS1 Output Select bit for Ethernet-MAC</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "E_CKE" -->
            <field>
              <name>E_CKE</name>
              <description>E_COUT Output Select bit</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "E_MD1B" -->
            <field>
              <name>E_MD1B</name>
              <description>E_MDO1 I/O Select bit</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "E_MD0B" -->
            <field>
              <name>E_MD0B</name>
              <description>E_MDO0 I/O Select bit</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "E_MC1B" -->
            <field>
              <name>E_MC1B</name>
              <description>E_MDC1 I/O Select bit</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "E_MC0E" -->
            <field>
              <name>E_MC0E</name>
              <description>E_MDC0 Output Select bit</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "E_TE1E" -->
            <field>
              <name>E_TE1E</name>
              <description>E_TXER0_TXEN1 Output Select bit</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "E_TE0E" -->
            <field>
              <name>E_TE0E</name>
              <description>E_TXEN0 Output Select bit</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "E_TD1E" -->
            <field>
              <name>E_TD1E</name>
              <description>E_TX02_TX10/E_TX03_TX11 Output Select bit</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "E_TD0E" -->
            <field>
              <name>E_TD0E</name>
              <description>E_TX00/E_TX01 Output Select bit</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QZIN2S" -->
            <field>
              <name>QZIN2S</name>
              <description>QDU-ch.2 ZIN Input Pin bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QBIN2S" -->
            <field>
              <name>QBIN2S</name>
              <description>QDU-ch.2 BIN Input Pin bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QAIN2S" -->
            <field>
              <name>QAIN2S</name>
              <description>QDU-ch.2 AIN Input Pin bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
